EA/src/Enums/ТипыОбъектовМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТипыОбъектовМ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Справочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БизнесПроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрСведений</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

EA/src/Enums/ТипыОбъектовМ/ManagerModule.bsl
Функция ПолучитьКоллекциюМетаданныхПоТипуОбъектаМ( ЗначениеТипа ) Экспорт
	
	Если ЗначениеТипа = Перечисления.ТипыОбъектовМ.Справочник Тогда
		Возврат Метаданные.Справочники;
	ИначеЕсли ЗначениеТипа = Перечисления.ТипыОбъектовМ.Документ Тогда
		Возврат Метаданные.Документы;
	ИначеЕсли ЗначениеТипа = Перечисления.ТипыОбъектовМ.БизнесПроцесс Тогда
		Возврат Метаданные.БизнесПроцессы;
	ИначеЕсли ЗначениеТипа = Перечисления.ТипыОбъектовМ.Задача Тогда
		Возврат Метаданные.Задачи;
	ИначеЕсли ЗначениеТипа = Перечисления.ТипыОбъектовМ.РегистрСведений Тогда
		Возврат Метаданные.РегистрыСведений;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьМенеджерКоллекциПоТипуОбъектаМ( ЗначениеТипа ) Экспорт
	
	Если ЗначениеТипа = Перечисления.ТипыОбъектовМ.Справочник Тогда
		Возврат Справочники;
	ИначеЕсли ЗначениеТипа = Перечисления.ТипыОбъектовМ.Документ Тогда
		Возврат Документы;
	ИначеЕсли ЗначениеТипа = Перечисления.ТипыОбъектовМ.БизнесПроцесс Тогда
		Возврат БизнесПроцессы;
	ИначеЕсли ЗначениеТипа = Перечисления.ТипыОбъектовМ.Задача Тогда
		Возврат Задачи;
	ИначеЕсли ЗначениеТипа = Перечисления.ТипыОбъектовМ.РегистрСведений Тогда
		Возврат РегистрыСведений;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьТипВсеСсылкиКоллекцииМетаданныхПоТипуОбъектаМ( ЗначениеТипа ) Экспорт
	
	Если ЗначениеТипа = Перечисления.ТипыОбъектовМ.РегистрСведений Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	МенеджерКоллекции = ПолучитьМенеджерКоллекциПоТипуОбъектаМ( ЗначениеТипа );
	
	Если МенеджерКоллекции <> Неопределено Тогда
		Возврат МенеджерКоллекции.ТипВсеСсылки();
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
